src/cf/InformationRegisters/вогДиапазоныКатегорииКлиетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогДиапазоныКатегорииКлиетов</Name>
			<InformationRegisterPeriodicity>Quarter</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НижняяГраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерхняяГраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеДиапазона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогДиапазоныКатегорииКлиетов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура НижняяГраницаПриИзменении(Элемент)
	
	Запись.ПредставлениеДиапазона = ?(ЗначениеЗаполнено(Запись.НижняяГраница),"от " + Запись.НижняяГраница,"") + ?(ЗначениеЗаполнено(Запись.ВерхняяГраница)," до " + Запись.ВерхняяГраница,"") + " руб.";
	
КонецПроцедуры

&НаКлиенте
Процедура ВерхняяГраницаПриИзменении(Элемент)
	
	Запись.ПредставлениеДиапазона = ?(ЗначениеЗаполнено(Запись.НижняяГраница),"от " + Запись.НижняяГраница,"") + ?(ЗначениеЗаполнено(Запись.ВерхняяГраница)," до " + Запись.ВерхняяГраница,"") + " руб.";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КатегорияКлиента = ПланыВидовХарактеристик.CRM_Классификаторы.ПолучитьСсылку(Новый УникальныйИдентификатор("6dc27b50-aae3-11ea-8c71-005056bc3fe8"));
	НовыеПараметрыВыбора = Новый ПараметрВыбора("Отбор.Владелец",КатегорияКлиента);
	Массив = Новый Массив;
	Массив.Добавить(НовыеПараметрыВыбора);
	МассивПараметровВыбора = Новый ФиксированныйМассив(Массив);
	Элементы.Категория.ПараметрыВыбора = МассивПараметровВыбора;
	
КонецПроцедуры
